[M_RobotSlaughter_1 MissionDefinition]
MissionName="Kill Hyperion: Turn 1"
MissionDescription="You are very brave. Controlled by Consoler 5000 (an old Hyperion docking robot), Loop fights all kinds of Hyperion assassins. If you complete all five steps you will receive a reward."
TurnInDescription="You've completed the first round of the Hyperion Massacre, but that's just the beginning.."
MissionSummary="Watch the first episode of Hyperion Massacre LIVE!!"
MissionGiver="5000 consoles"
MissionTurnInLocation="5000 consoles"
TeaserText="Welcome to Hyperion's Circle of Death! "

[M_RobotSlaughter_1:AssembleInArena MissionObjectiveDefinition]
ProgressMessage="Go over"

[M_RobotSlaughter_1:AssembleInArenaSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_1:killwithcrit MissionObjectiveDefinition]
ProgressMessage="Hit an enemy, dealing lethal damage"

[M_RobotSlaughter_1:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Survive the first round"

[M_RobotSlaughter_1:Wave1Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_1:WavesComplete MissionObjectiveDefinition]
ProgressMessage="fill the waves"

[M_RobotSlaughter_2 MissionDefinition]
MissionName="Hyperion Massacre: Part 2"
MissionDescription="You discovered Moxie's new evil nature. The Consoler 5000 (aka the Hyperion Dockerbot, powered by the bilingual Moxie) will forgive you for all the Hyperion horror. Complete 5 rounds and get great prizes.."
TurnInDescription="Two rings are missing. If you continue to follow these steps, you will complete the Hyperion Massacre in record time.."
MissionSummary="Avoid another kitchen in Hyperion!!"
MissionGiver="5,000 plates"
MissionTurnInLocation="5000 consoles"
TeaserText="Should we all start now? "

[M_RobotSlaughter_2:AssembleInArena MissionObjectiveDefinition]
ProgressMessage="Open the options"

[M_RobotSlaughter_2:AssembleInArenaSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_2:killcrithit MissionObjectiveDefinition]
ProgressMessage="Hit the enemy hard."

[M_RobotSlaughter_2:SurviveRound MissionObjectiveDefinition]
ProgressMessage="survive the second round"

[M_RobotSlaughter_2:Wave2Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_2:WavesComplete MissionObjectiveDefinition]
ProgressMessage="Stop the waves"

[M_RobotSlaughter_3 MissionDefinition]
MissionName="The Destruction of Hyperion: Part III"
MissionDescription="The latest round of Moxie's murder is revealed. It is controlled by the 5000 connections (a former Hyperion docking robot reprogrammed by Moxxi to always be bilingual). If you survive all five rounds, you win the grand prize.."
TurnInDescription="In Hyperion, you will be killed. Don't stop now.!"
MissionSummary="Experience the third round of carnage on Hyperion!!"
MissionGiver="5000 capacitors"
MissionTurnInLocation="5000 people"
TeaserText="This is the third attempt to kill Hyperion! Hope you brought enough ammo!"

[M_RobotSlaughter_3:AssembleInArena MissionObjectiveDefinition]
ProgressMessage="is"

[M_RobotSlaughter_3:AssembleInArenaSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_3:crithits MissionObjectiveDefinition]
ProgressMessage="Defeat enemies with critical hits"

[M_RobotSlaughter_3:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Survive the third round!"

[M_RobotSlaughter_3:Wave3Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_3:WavesComplete MissionObjectiveDefinition]
ProgressMessage="Download the wave."

[M_RobotSlaughter_4 MissionDefinition]
MissionName="Kill Hyperion: Round 4"
MissionDescription="You have the final task to kill Moxie. Controlled by the 5000 consoles (a Hyperion docker robot that Moxxi constantly renders as bilingual), the round pits all of Hyperion's assassins against each other. If you survive the five stages, you will be rewarded."
TurnInDescription="You only have one time to finish killing Hyperion. Do you think they did??"
MissionSummary="Relive the fourth episode of the Hyperion Massacre.!"
MissionGiver="5000 mln"
MissionTurnInLocation="console 5000"
TeaserText="The fourth installment of the Hyperion Massacre is about to get even more intense! Check your device first."

[M_RobotSlaughter_4:AseembleInArenaSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_4:AssembleInArena MissionObjectiveDefinition]
ProgressMessage="come here"

[M_RobotSlaughter_4:crithits MissionObjectiveDefinition]
ProgressMessage="Defeat the enemy with a powerful blow"

[M_RobotSlaughter_4:SurviveRound MissionObjectiveDefinition]
ProgressMessage="4 stages of life"

[M_RobotSlaughter_4:Wave4Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_4:WavesComplete MissionObjectiveDefinition]
ProgressMessage="All the words"

[M_RobotSlaughter_5 MissionDefinition]
MissionName="The Killing of Hyperion. 5:00"
MissionDescription="Controlled by the Consolidator 5000 (an ancient Hyperion docking robot to talk to Moxie in constant spin mode); It has the perfect damage signal to compete with Hyperion's numerous attacks. If you escape all 5 times, you get a prize.."
TurnInDescription="You have successfully killed Hyperion! Mechanical heroes around the world whisper about you; Or if the robot whistles, he will whistle. or show emotion."
MissionSummary="Survive the final round to defeat Hyperion.!"
MissionGiver="Consoleitor 5000"
MissionTurnInLocation="Consoleitor 5000"
TeaserText="Can you survive Hyperion's latest massacre? "

[M_RobotSlaughter_5:AssembleInArena MissionObjectiveDefinition]
ProgressMessage="Speak loudly"

[M_RobotSlaughter_5:AssembleInArenaSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_5:crithits MissionObjectiveDefinition]
ProgressMessage="Hit your enemies hard."

[M_RobotSlaughter_5:SurviveRound MissionObjectiveDefinition]
ProgressMessage="Get rid of the last step"

[M_RobotSlaughter_5:Wave5Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_RobotSlaughter_5:WavesComplete MissionObjectiveDefinition]
ProgressMessage="Fill the hood"

